# StructuralSectionPipestandardWalldesignthickness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionPipestandardWalldesignthickness Property
ParameterTypeId Class See Also
---
"Wall Design Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionPipestandardWalldesignthickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionPipestandardWalldesignthickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionPipestandardWalldesignthickness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace